In [1]:
import pandas as pd
import numpy as np

In [2]:
businesses = [
    {"name":"Syria Sweets Ltd","city":"Manchester","type":"Dessert","avg_price":12},
    {"name":"Mr. Knafah","city":"Manchester","type":"Dessert","avg_price":10},
    {"name":"Al Hamra","city":"Manchester","type":"Candy Store","avg_price":8},
    {"name":"Emesa sweet & dessert","city":"Manchester","type":"Dessert","avg_price":9},
    {"name":"Sweetland London","city":"London","type":"Candy Store","avg_price":10},
    {"name":"I baklawa LTD","city":"London","type":"Baklava & Sweets","avg_price":11}
]

df_business = pd.DataFrame(businesses)
df_business

                    name        city              type  avg_price
0       Syria Sweets Ltd  Manchester           Dessert         12
1             Mr. Knafah  Manchester           Dessert         10
2               Al Hamra  Manchester       Candy Store          8
3  Emesa sweet & dessert  Manchester           Dessert          9
4       Sweetland London      London       Candy Store         10
5          I baklawa LTD      London  Baklava & Sweets         11

In [3]:
menu = [
    {"shop":"Syria Sweets Ltd","item":"Konafa","price":10},
    {"shop":"Syria Sweets Ltd","item":"Basbousa","price":8},
    {"shop":"Mr. Knafah","item":"Kunafa","price":12},
    {"shop":"Mr. Knafah","item":"Baklava","price":7},
    {"shop":"Al Hamra","item":"Baklava Box","price":8},
    {"shop":"I baklawa LTD","item":"Assorted Baklava","price":11},
]

df_menu = pd.DataFrame(menu)
df_menu

               shop              item  price
0  Syria Sweets Ltd            Konafa     10
1  Syria Sweets Ltd          Basbousa      8
2        Mr. Knafah            Kunafa     12
3        Mr. Knafah           Baklava      7
4          Al Hamra       Baklava Box      8
5     I baklawa LTD  Assorted Baklava     11

In [4]:
def estimate_customers(city):
    if city == "Manchester":
        return np.random.randint(100, 250)  # more local traffic
    else:
        return np.random.randint(80, 200)

In [5]:
import random

results = []
for idx,row in df_business.iterrows():
    customers = estimate_customers(row['city'])
    avg_spend = row['avg_price']
    weekly_revenue = customers * avg_spend
    cogs = weekly_revenue * 0.4
    weekly_profit = weekly_revenue - cogs
    yearly_profit = weekly_profit * 50  # 50 working/peak weeks
    results.append({
        "shop":row['name'],
        "weekly_profit":weekly_profit,
        "yearly_profit":yearly_profit
    })

df_profit = pd.DataFrame(results)
df_profit

                    shop  weekly_profit  yearly_profit
0       Syria Sweets Ltd         1648.8        82440.0
1             Mr. Knafah          918.0        45900.0
2               Al Hamra          643.2        32160.0
3  Emesa sweet & dessert          707.4        35370.0
4       Sweetland London          924.0        46200.0
5          I baklawa LTD         1300.2        65010.0

In [6]:
df_profit = df_profit.merge(df_business, left_on="shop", right_on="name")
df_profit.groupby("city")[["weekly_profit","yearly_profit"]].sum()

            weekly_profit  yearly_profit
city
London             2224.2       111210.0
Manchester         3917.4       195870.0